tests/load_tests.yml
config:
  target: 'https://satchecker.cps.iau.org'  # Base URL
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 50   # Increase gradually
      name: "Initial"
    - duration: 60
      arrivalRate: 50
      name: "Sustained"
    - duration: 10
      arrivalRate: 100
      name: "Spike"
    - duration: 30
      arrivalRate: 20
      name: "Recovery"
      
# These run sequentially
scenarios:
  - flow:
      - get:
          url: "/ephemeris/name/?name=STARLINK-1477&elevation=100&latitude=33&longitude=-110&julian_date=2460546.599502"
      - get:
          url: "/fov/satellite-passes/?latitude=43.1929&longitude=-81.325655&elevation=327&mid_obs_time_jd=2460584.519211&duration=60&ra=224.048903&dec=78.778084&fov_radius=1"

# These distribute requests evenly
  - name: Fetch Ephemeris for Starlink
    flow:
      - get:
          url: "/ephemeris/name/?name=STARLINK-1477&elevation=100&latitude=33&longitude=-110&julian_date=2460546.599502"

  - name: Fetch Ephemeris for ISS
    flow:
      - get:
          url: "/ephemeris/name/?name=ISS&elevation=100&latitude=40&longitude=-75&julian_date=2460546.599502"